# VisGraphicsPointClouds Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VisGraphicsPointClouds Property
ParameterTypeId Class See Also
---
"V/G Overrides Point Clouds"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VisGraphicsPointClouds { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VisGraphicsPointClouds As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VisGraphicsPointClouds {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace